package seminar_5;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.Scanner;

public class hw_52 {
   /*
    * Пусть дан список сотрудников:
    * Иван Иванов
    * Светлана Петрова
    * Кристина Белова
    * Анна Мусина
    * Анна Крутова
    * Иван Юрин
    * Петр Лыков
    * Павел Чернов
    * Петр Чернышов
    * Мария Федорова
    * Марина Светлова
    * Мария Савина
    * Мария Рыкова
    * Марина Лугова
    * Анна Владимирова
    * Иван Мечников
    * Петр Петин
    * Иван Ежов
    * Написать программу, которая найдет и выведет повторяющиеся имена с
    * количеством повторений.
    * Отсортировать по убыванию популярности Имени.
    */
   public static void main(String[] args) {
     
   }
}

